Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Due to shared state
ru: Благодаря общему состоянию

source: Due to undefined behavior
ru: Из-за неопределенного поведения

source: Duplicate code for better performance
ru: Дублирование кода for улучшает производительность

source: Duplicates all fields
ru: Дублирует все поля

source: Duplicates hosting code
ru: Дубликаты кода хостинга

source: Duplication prohibition
ru: Запрет на дублирование

source: dyn Trait lets you work through a shared interface
ru: dyn Трейт позволяет работать через общий интерфейс

source: Dynamic
ru: Динамический

source: Dynamic dispatch
ru: Динамическая диспетчеризация

source: Dynamic dispatch — method selection happens at runtime via pointers in trait object
ru: Динамическая диспетчеризация - выбор метода происходит во время выполнения через указатели in trait объекта

source: Dynamic dispatch has runtime cost and prevents inline optimizations
ru: Динамическая диспетчеризация требует затрат во время выполнения и препятствует встроенным оптимизациям

source: Dynamic typing
ru: Динамическая типизация

source: e.g. break 'outer;
ru: например, break 'outer;

source: Each file in src/bin becomes a separate binary crate
ru: Каждый файл in src/bin становится отдельным двоичным файлом crate

source: Each method and trait on the wrapped type must be manually implemented on the newtype
ru: Каждый метод и trait в обернутом type должен быть реализован вручную в newtype

source: Each service needs unique access syntax
ru: Для каждой службы необходим уникальный синтаксис доступа

source: Each struct is a distinct type. Rust is strongly typed
ru: Каждый struct является отдельным type. Rust сильно типизирован

source: Early cleanup when needed
ru: Ранняя уборка при необходимости

source: Early return must match the function's return type
ru: Ранний return должен match функцию return type

source: Easier reasoning about code due to immutability
ru: Легче рассуждать о коде благодаря неизменяемости

source: Easier syntax
ru: Более простой синтаксис

source: Easier testing only
ru: Только более легкое тестирование

source: Easier to read
ru: Легче читать

source: Either many Ref, or one RefMut
ru: Либо много Ref, либо один RefMut

source: Either one &mut or any number of &, but not both simultaneously
ru: Либо один &amp;mut, либо любое количество &amp;, но не оба одновременно

source: Either<A, B>
ru: Либо<A, B>

source: Either<T, E>
ru: Либо<T, E>

source: Element directly
ru: Элемент напрямую

source: else is optional
ru: else необязательно

source: email(user)
ru: email(пользователь)

source: embedded-hal for embedded devices
ru: embedded-hal for встраиваемые устройства

source: embedded-hal uses generics to statically verify pin mode configurations
ru: embedded-hal использует дженерики для статической проверки конфигураций режима работы выводов

source: Empty enum
ru: Пустой enum

source: Empty tuple
ru: Пустой кортеж

source: Empty value
ru: Пустое значение

source: Emulating inheritance
ru: Эмулирование наследования

source: Enables backtrace output
ru: Включает вывод обратной трассировки

source: Enables debug formatting
ru: Включает форматирование отладки

source: Enables garbage collection
ru: Включает сборку мусора

source: Enables runtime testing
ru: Обеспечивает тестирование во время выполнения

source: Enables trait objects for dynamic dispatch
ru: Включает trait объектов for динамической диспетчеризации

source: Encapsulated types and Transactional types
ru: Инкапсулированные типы и транзакционные типы

source: Encapsulated types are opaque and owned by Rust, Transactional types are transparent and owned by the user
ru: Инкапсулированные типы непрозрачны и принадлежат Rust, транзакционные типы прозрачны и принадлежат пользователю

source: Encapsulated types are owned by the library with users managing lifecycle through functions
ru: Инкапсулированные типы принадлежат библиотеке, а пользователи управляют их жизненным циклом с помощью функций

source: Encapsulation
ru: Инкапсуляция

source: Encapsulation enforces correctness at the type level
ru: Инкапсуляция обеспечивает корректность на уровне type

source: Encapsulation hides internal state and prevents unauthorized direct access to components
ru: Инкапсуляция скрывает внутреннее состояние и предотвращает несанкционированный прямой доступ к компонентам

source: Encapsulation means implementation details are not accessible to code using the object
ru: Инкапсуляция означает, что детали реализации недоступны для кода, использующего объект

source: Encapsulation restricts direct access to internal components, protecting data integrity
ru: Инкапсуляция ограничивает прямой доступ к внутренним компонентам, защищая целостность данных

source: Encoding states in type system prevents some bugs at compile time
ru: Система кодирования состояний in type предотвращает некоторые ошибки во время компиляции

source: Ensures exhaustiveness
ru: Обеспечивает исчерпывающий характер

source: entry returns an Entry, on which you can call or_insert
ru: entry возвращает Entry, для которого можно вызвать or_insert

source: Enum variant
ru: Вариант перечисления

source: Enum variants
ru: Варианты перечислений

source: Enum variants are private
ru: Варианты Enum являются частными

source: enumerate returns pairs (index, element)
ru: enumerate возвращает пары (индекс, элемент)

source: Enums always use less memory
ru: Перечисления всегда use меньше памяти

source: Enums and Pattern Matching
ru: Перечисления и сопоставление шаблонов

source: Enums are clearer and shorter
ru: Перечисления понятнее и короче

source: Enums are faster
ru: Перечисления быстрее

source: Enums can contain different kinds of data, e.g., V4(u8, u8, u8, u8)
ru: Перечисления могут содержать различные типы данных, например, V4(u8, u8, u8, u8)

source: Enums describe variants; match handles them reliably. It's the Rust foundation for choice and control flow
ru: Enums описывают варианты; match надежно обрабатывает их. Это основа Rust for выбор и поток управления

source: Enums support impl blocks. Methods work like with structs
ru: Enums поддерживают блоки impl. Методы работают как со структурами

source: Enums use braces with listed variants. That's standard Rust syntax
ru: Enums use скобки с перечислением вариантов. Это стандартный синтаксис Rust

# enums_and_pattern_matching_link
source: https://doc.rust-lang.org/book/ch06-00-enums.html
ru: https://doc.rust-lang.ru/book/ch06-00-enums.html

source: Equivalent to for loop
ru: Эквивалент for loop

source: Error
ru: Ошибка

source: Error handler
ru: Обработчик ошибок

source: Error Handling
ru: Обработка ошибок

source: Error handling pattern
ru: Образец обработки ошибок

source: Error messages
ru: Сообщения об ошибках

source: Error protection
ru: Защита от ошибок

source: Error type
ru: Ошибка type

source: Error types
ru: Типы ошибок

# error_handling_link
source: https://doc.rust-lang.org/book/ch09-00-error-handling.html
ru: https://doc.rust-lang.ru/book/ch09-00-error-handling.html

source: Error: missing lifetime specifier
ru: Ошибка: отсутствует спецификатор времени жизни

source: Error: no Display
ru: Ошибка: нет дисплея

source: ErrorKind indicates the class of error
ru: ErrorKind указывает на класс ошибки

source: Even inside unsafe function, unsafe blocks are needed for unsafe operations
ru: Даже внутри функции unsafe необходимы блоки unsafe for unsafe операций

source: Even with pub struct, fields are private by default
ru: Даже при использовании pub struct поля по умолчанию являются приватными

source: Even with pub struct, fields are private unless marked pub
ru: Даже при использовании pub struct поля являются закрытыми, если они не отмечены pub

source: Every module should know all alternatives
ru: Каждый модуль должен знать все альтернативы

source: Everyone sees everyone
ru: Все видят всех

source: Everything is public
ru: Все открыто

source: Everything prints
ru: Все принты

source: Everything works
ru: Все работает

source: Everything's fine
ru: Все в порядке

source: Everywhere
ru: Везде

source: Example of a method that consumes an iterator:
ru: Пример метода, потребляющего итератор:

source: Example of an adapter method (doesn't consume iterator):
ru: Пример метода-адаптера (не потребляет итератор):

source: Example: impl<T: Display> ToString for T
ru: Пример: impl<T: Display> ToString for T

source: Exclusive range
ru: Эксклюзивный ассортимент

source: execute and rollback
ru: выполнение и откат

source: Execute commands in sequence
ru: Выполнение команд in последовательность

source: Executes loop while pattern continues to match
ru: Выполнение loop while продолжается match

source: Executes once
ru: Выполняется один раз

source: Exit loop and return value
ru: Выйти из значений loop и return

source: expect with a clear message
ru: ожидайте с четким посланием

source: expected mark %lld%%
ru: предполагаемая оценка %lld%%

source: Expects the test to panic
ru: Ожидает, что test запаникует

source: Explicit type for variable:
ru: Явная type for переменная:

source: Explicitly deny specific lints by name
ru: Явное запрещение определенных линков по имени

source: Explicitly yields control to the runtime
ru: Явно передает управление среде выполнения

source: Exports hosting outward as part of the public API
ru: Экспорт хостинга наружу as часть публичного API

source: Exports it outward
ru: Экспортирует его наружу

source: Exports macro to file
ru: Экспорт macro в файл

source: Exposing all internal state
ru: Раскрытие всех внутренних состояний

source: Expression computes a value
ru: Выражение вычисляет значение

source: Extends the owner's lifetime
ru: Продлевает срок службы владельца

source: extern "C" defines ABI (Application Binary Interface) for calling functions from other languages
ru: extern "C" определяет ABI (Application Binary Interface) for, вызывая функции из других языков

source: Extern blocks must be unsafe since Rust cannot verify external code
ru: Внешние блоки должны быть unsafe, поскольку Rust не может проверять внешний код

source: External crates are added as dependencies in Cargo.toml
ru: Добавлены внешние крейты as зависимости in Cargo.toml

source: Extracts Some value, leaving None
ru: Извлекает значение Some, оставляя None

source: Fairness doesn't apply to join
ru: Справедливость не распространяется на компанию

source: Fast increment of counter, data is not copied
ru: Быстрое приращение счетчика, данные не копируются

source: Faster code execution
ru: Более быстрое выполнение кода

source: Faster compilation
ru: Более быстрая компиляция

source: Faster execution
ru: Более быстрое выполнение

source: Faster serialization
ru: Более быстрая сериализация

source: Faster single-threaded compilation
ru: Более быстрая однопоточная компиляция

source: Faster than static dispatch
ru: Быстрее, чем static

source: Fearless Concurrency
ru: Бесстрашный параллелизм

# fearless_concurrency_link
source: https://doc.rust-lang.org/book/ch16-00-concurrency.html
ru: https://doc.rust-lang.ru/book/ch16-00-concurrency.html

source: Feb
ru: Февраль

source: FFI doesn't support iterators
ru: FFI не поддерживает итераторы

source: Field x is private
ru: Поле x является частным

source: Field x is public
ru: Поле x является общедоступным

source: Fields are always public
ru: Поля всегда являются общедоступными

source: Fields are hidden only with mod
ru: Поля скрываются только с помощью mod

source: Fields are private by default
ru: Поля по умолчанию являются приватными

source: Fields are specified only by types. It's a mix of tuple and struct
ru: Поля задаются только типами. Это смесь кортежа и struct

source: Fields are the components of a struct, each with its own name and type. Unlike tuples, a struct gives names to data
ru: Поля - это компоненты struct, каждый из которых имеет свое имя и type. В отличие от кортежей, struct дает имена данным

source: File
ru: Файл

source: File, line, and result
ru: Файл, строка и результат

source: File::open()?.read_to_string()? (with a buffer)
ru: Файл::open()?.read_to_string()? (с буфером)

source: file.rs or dir/mod.rs
ru: file.rs или dir/mod.rs

source: filter
ru: фильтр

source: filter calls the closure with a reference to the element
ru: фильтр вызывает закрытие со ссылкой на элемент

source: Filter items from a collection
ru: Фильтр элементов из коллекции

source: filter keeps only elements for which the condition is true
ru: фильтр сохраняет только элементы for, для которых условие true

source: Filtering by name works through the cargo test argument
ru: Фильтрация по имени работает через аргумент cargo test

source: Filters items
ru: Фильтры элементов

source: finally blocks
ru: наконец, блоки

source: find
ru: найти

source: find returns Some(first element), or None
ru: find возвращает Some(первый элемент), или None

source: First accepts a value, second accepts a closure
ru: Первый принимает значение, второй - закрытие

source: First always panics
ru: Первый всегда паникует

source: First function parameter
ru: Первый параметр функции

source: First works faster
ru: Первый работает быстрее

source: Five
ru: Пять

source: Fixed length
ru: Фиксированная длина

source: Fixed-size type
ru: Фиксированный размер type

source: Flat enums should be converted to integer codes for simple C-compatible error handling
ru: Плоские перечисления должны быть преобразованы в целочисленные коды for простая обработка ошибок, совместимая с Си

source: fn change(&mut self) { … }
ru: fn change(&amp;mut self ) { ... }

source: fn change(&self) { … }
ru: fn change(&amp;self) { ... }

source: fn change(self&) { … }
ru: fn change(self&amp;) { ... }

source: fn f() -> i32 { 5 }
ru: fn f() -&gt; i32 { 5 }

source: fn f() => i32 { 5 }
ru: fn f() =&gt; i32 { 5 }

source: fn first_word(s: &str) -> &str
ru: fn first_word(s: &amp;str) -&gt; &ampstr

source: fn first_word(s: &String) -> &str
ru: fn first_word(s: &amp;String) -&gt; &ampstr

source: fn first_word(s: String) -> &str
ru: fn first_word(s: String) -&gt; &ampstr

source: fn first_word<T>(s: T) -> &str
ru: fn first_word<T>(s: T) -&gt; &ampstr

source: fn foo() -> dyn Trait
ru: fn foo() -&gt; dyn Трейт

source: fn foo() -> impl Trait
ru: fn foo() -&gt; impl Трейт

source: fn foo() -> Trait
ru: fn foo() -&gt; Trait

source: fn foo(T: i32) -> T
ru: fn foo(T: i32) -&gt; T

source: fn foo(x: &str, y: &str) -> &str
ru: fn foo(x: &amp;str, y: &amp;str) -&gt; &ampstr

source: fn foo(x: &str, y: &str) -> &String
ru: fn foo(x: &amp;str, y: &amp;str) -&gt; &ampString

source: fn foo(x: &str) -> &str
ru: fn foo(x: &amp;str) -&gt; &ampstr

source: fn foo<'a>(x: &'a str, y: &'a str) -> &'a str
ru: fn foo&lt;'a&gt;(x: &amp;'a str, y: &amp;'a str) -&gt; &amp;'a str

source: fn foo<T: impl Summary>(x: T)
ru: fn foo&lt;T: impl Summary&gt;(x: T)

source: fn foo<T: Trait>() -> T
ru: fn foo<T: Trait>() -&gt; T

source: fn foo<T>(x: T) -> T
ru: fn foo<T>(x: T) -&gt; T

source: fn is function pointer type for passing functions as values
ru: fn указатель функции type for передача функций as значения

source: fn main() -> Option<()> { File::open("x")?; Some(()) }
ru: fn main() -&gt Option<()> { Файл::open("x")?; Some(()) }

source: fn main() -> Result<(), Box<dyn std::error::Error>> { File::open("x")?; Ok(()) }
ru: fn main() -&gt Result&lt;(), Box&lt;dyn std ::error::Error&gt;&gt; { Файл::open("x")?; Ok(()) }

source: fn main() { File::open("x")?; }
ru: fn main() { Файл::open("x")?; }

source: fn() -> closure
ru: fn() -&gt; закрытие

source: fn() -> Fn
ru: fn() -&gt; Fn

source: fn() -> impl Fn
ru: fn() -&gt; impl Fn

source: fold
ru: сложить

source: Fold can only work with trees
ru: Фолд может работать только с деревьями

source: fold is a higher-order function that composes operations, describing what to do rather than how
ru: fold - это функция более высокого порядка, которая компонует операции, описывая, что do, а не как

source: Folder trait has specific methods for each type of node in the data structure
ru: Папка trait имеет специфические методы for каждого type узла in структуры данных

source: For an enum, making it pub makes all its variants public
ru: Для enum, если сделать его pub, то все его варианты станут общедоступными

source: For automatic Debug
ru: Для автоматического Debug

source: For automatic Drop
ru: Для автоматического сброса

source: For better performance
ru: Для повышения производительности

source: For cloning
ru: Для клонирования

source: For code beauty
ru: Для красоты кода

source: For coercion &mut T → &mut U
ru: Для принуждения иmut T → иmut U

source: For coercion &T → &U
ru: Для принуждения &amp;T → &amp;U

source: For convenient debug printing of structures
ru: Для удобной отладочной печати структур

source: For debugging
ru: Для отладки

source: For deep copy
ru: Для глубокого копирования

source: For default copying
ru: Для копирования по умолчанию

source: For dynamic dispatch via trait object
ru: Для динамической диспетчеризации через объект trait

source: For example, iterators/Box/Rc when properly applied don't add overhead beyond necessary
ru: Например, iterators/Box/Rc при правильном применении не добавляют накладных расходов сверх необходимых

source: For expected failures (e.g., API rate limit), what's better?
ru: Что лучше для ожидаемых отказов (например, ограничение скорости API)?

source: For faster compilation
ru: Для ускорения компиляции

source: For file I/O
ru: Для ввода/вывода файлов

source: For generics
ru: Для дженериков

source: For GUIs
ru: Для графических интерфейсов

source: For heap work
ru: Для работы в куче

source: For highly concurrent workloads with many sources
ru: Для высокоскоростных рабочих нагрузок с большим количеством источников

source: For highly parallelizable work
ru: Для работы с высокой степенью распараллеливания

source: for i in &mut v { *i += 1; }
ru: for i in &amp;mut v { *i += 1; }

source: for i in &v {}
ru: for i in &amp;v {}

source: for internally creates and consumes an iterator
ru: for внутренне создает и потребляет итератор

source: for is always faster
ru: for всегда быстрее

source: for is syntactic sugar for iterator
ru: for синтаксический сахар for итератор

source: For math-heavy computation
ru: Для тяжелых математических вычислений

source: For multithreading, Arc<T> is used (Chapter 16)
ru: Для многопоточности, Arc<T> используется (глава 16)

source: For network I/O
ru: Для сетевого ввода/вывода

source: For optimizations
ru: Для оптимизации

source: For performance
ru: За производительность

source: For printing only
ru: Только для печати

source: For prototypes or when the developer is learning ownership
ru: Для прототипов или когда разработчик учится владению

source: For refutable patterns, use if let or let...else instead of plain let
ru: Для опровержимых шаблонов вместо простого use if let или let...else let

source: For resource cleanup
ru: Для очистки ресурсов

source: For runtime type reflection
ru: Для выполнения type отражение

source: For speed
ru: Для скорости

source: For storing values of concrete type
ru: Для хранения значений бетона type

source: For type safety
ru: Для безопасности type

source: for uses pointers
ru: for использует указатели

source: for_each calls the closure for each element
ru: for_each вызывает закрытие for каждого элемента

source: Forbid parents
ru: Запретить родителям

source: Forbidden by compiler
ru: Запрещено компилятором

source: Forbidden in enum
ru: Запрещенный in enum

source: Forbidden in Rust
ru: Запрещенный in Ржавчина

source: Forbids ?
ru: Запрещает?

source: Format-specific parsing details
ru: Детали разбора, специфичные для конкретного формата

source: format! is usually the most succinct and readable way to combine strings
ru: format! обычно является наиболее лаконичным и удобным для чтения способом объединения строк

source: format! takes references; nothing is moved
ru: формат! принимает ссылки; ничего не перемещается

source: Four
ru: Четыре

source: Frees the original
ru: Освобождает оригинал

source: From and Into
ru: От и до

source: FromStr and ToString
ru: FromStr и ToString

source: FromStr and ToString form a Poly Iso for string conversion with generic type T
ru: FromStr и ToString образуют преобразование строк Poly Iso for с общим type T

source: Full file path
ru: Полный путь к файлу

source: Full module name
ru: Полное название модуля

source: Fully qualified syntax: <Type as Trait>::function() for disambiguation
ru: Полный синтаксис: &lt;Type as Trait&gt;::function() for disambiguation

source: Function always with fn, closure with ||
ru: Функция всегда обозначается fn, закрытие - ||

source: Function declaration:
ru: Декларация функций:

source: Function macro
ru: Функция macro

source: Function naming style:
ru: Стиль именования функций:

source: Function parameters:
ru: Функциональные параметры:

source: Function pointers
ru: Указатели функций

source: Function pointers can store references to functions and closures for command execution
ru: Указатели функций могут хранить ссылки на функции и закрытия for выполнение команд

source: Function pointers implement all three closure traits
ru: Функциональные указатели реализуют все три признака закрытия

source: Function std::panic::abort()
ru: Функция std::panic::abort()

source: Function with return value:
ru: Функция со значением return:

source: Functional Language Features — Iterators and Closures
ru: Функциональные возможности языка - итераторы и замыкания

source: Functional Programming
ru: Функциональное программирование

source: Functions are deprecated
ru: Функции устарели

source: Functions cannot accept parameters
ru: Функции не могут принимать параметры

source: Functions cannot capture values from their scope, closures can
ru: Функции не могут захватывать значения из своей области видимости, а закрытия - могут

source: Functions should not produce side effects, only commands may produce side effects
ru: Функции не должны создавать побочных эффектов, побочные эффекты могут создавать только команды

source: Functions with ! are called diverging — they never return control
ru: Функции с ! называются расходящимися - они никогда не return управление

source: Functions with errors
ru: Функции с ошибками

source: Functions without return type return it
ru: Функции без return type return it

source: Fundamentals of Asynchronous Programming in Rust
ru: Основы асинхронного программирования in Rust

source: future
ru: будущее

source: Future<T>
ru: Будущее<T>

source: Futures are lazy—they start progressing only when awaited/polled
ru: Фьючерсы ленивы - они начинают двигаться только тогда, когда их ждут/опрашивают

source: Garbage collector
ru: Сборщик мусора

source: Generated automatically
ru: Генерируется автоматически

source: Generates code for each type
ru: Генерирует код for для каждого type

source: Generic can only be one concrete type, trait objects allow different types
ru: Generic может быть только один конкретный type, trait объекты могут быть разных типов

source: Generic functions
ru: Общие функции

source: Generic is faster
ru: Дженерик быстрее

source: Generic is replaced by one type, trait object allows different types at runtime
ru: Generic заменяется одним type, trait объектом, позволяющим различать типы во время выполнения

source: Generic is slower
ru: Дженерик работает медленнее

source: Generic syntax
ru: Общий синтаксис

source: Generic type
ru: Дженерик type

source: Generic type parameters create different types that are recognized as distinct by the type system
ru: Общие type параметры создают различные типы, которые распознаются as системой type

source: Generic Types, Traits, and Lifetimes
ru: Общие типы, черты и время жизни

source: generics
ru: дженерики

source: Generics allow writing abstract code for different types without copying logic
ru: Дженерики позволяют писать abstract код for разных типов без копирования логики
